android-sdkmanager-cmdline.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-04-04 Wed 14:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Android sdk manager command line operations</title>
<meta name="generator" content="Org mode">
<meta name="author" content="md11235">
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Android sdk manager command line operations</h1>
<p>
copied from: <a href="https://stackoverflow.com/questions/17963508/how-to-install-android-sdk-build-tools-on-the-command-line">https://stackoverflow.com/questions/17963508/how-to-install-android-sdk-build-tools-on-the-command-line</a>
</p>

<p>
By default, the SDK Manager from the command line does not include the build tools in the list. They're in the "obsolete" category. To see all available downloads, use
</p>

<p>
android list sdk &#x2013;all
</p>

<p>
And then to get one of the packages in that list from the command line, use:
</p>

<p>
android update sdk -u -a -t &lt;package no.&gt;
</p>

<p>
Where -u stands for &#x2013;no-ui, -a stands for &#x2013;all and -t stands for &#x2013;filter.
</p>

<p>
If you need to install multiple packages do:
</p>

<p>
android update sdk -u -a -t 1,2,3,4,..,n 
</p>

<p>
Where 1,2,..,n is the package number listed with the list command above
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: md11235 (<a href="mailto:md11235@gmail.com">md11235@gmail.com</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org</a> mode 9.1.6)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>